app/views/home/index.html.erb

  <%end%>
     <%attendance.break.each do |rest|%>
---
SELECT `breaks`.* FROM `breaks` WHERE `breaks`.`attendance_id` = 1