app/helpers/application_helper.rb

SELECT `breaks`.* FROM `breaks` WHERE `breaks`.`attendance_id` = 1
---
  def sum_break_hour(attendance)
    sum=0
    attendance.break.each do |rest|