app/helpers/attendance_helper.rb

  def is_working(user)
    if Attendance.find_by(user_id:user.id).present? then
      last_attendance=Attendance.where(user_id:user.id).last
---
SELECT  `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 3 ORDER BY `attendances`.`id` DESC LIMIT 1

  def is_break(user)
    if Attendance.find_by(user_id:user.id).present? then
      last_attendance=Attendance.where(user_id:user.id).last
      if last_attendance.break_in_time.present? && last_attendance.break_out_time.nil? then
---
SELECT  `attendances`.* FROM `attendances` WHERE `attendances`.`id` = 3 LIMIT 1
SELECT  `breaks`.* FROM `breaks` WHERE `breaks`.`user_id` = 1 ORDER BY `breaks`.`id` DESC LIMIT 1