app/views/attendance/index.html.erb

  document.getElementById("out_time_btn").onclick = function() {
      var in_time = '<%=@user.attendance.last.in_time-Time.local(2019,1,1,9,0,0,0)%>';
---
SELECT  `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 3 ORDER BY `attendances`.`id` DESC LIMIT 1