app/controllers/admin_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @employees=User.all

SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 3 AND `attendances`.`in_time` BETWEEN '2019-02-01' AND '2019-02-28'
SELECT `earnings`.* FROM `earnings` WHERE `earnings`.`user_id` = 5 ORDER BY `earnings`.`date` ASC
---
  def show
    @year=Date.today.year
    @month=Date.today.month
    if !@attendances then
      @attendances=Attendance.where(user_id:@employee.id).date_month(@year,@month).order(:in_time)
    end
    if !@earnings then
      @earnings=Earning.where(user_id:@employee.id).order(:date)

SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 5 ORDER BY `attendances`.`in_time` ASC
---
  def attendance
  @year=Date.today.year
  @month=Date.today.month
    if !@attendances then
      @attendances=Attendance.where(user_id:@employee.id).date_month(@year,@month).order(:in_time)

SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 2 AND `attendances`.`in_time` BETWEEN '2019-02-01' AND '2019-03-01' ORDER BY `attendances`.`in_time` ASC
SELECT `earnings`.* FROM `earnings` WHERE `earnings`.`user_id` = 5 AND (date >= '2019-02-15')
---
  def search_month
    @attendances=Attendance.where(user_id:@employee.id).date_month(params[:year],params[:month]).order(:in_time)
    @earnings=Earning.where(user_id:@employee.id).date_month(params[:year], params[:month]).order(:date)

SELECT `earnings`.* FROM `earnings` WHERE `earnings`.`user_id` = 5 AND `earnings`.`date` BETWEEN '2019-02-09' AND '2019-03-02'
---
  def earning
    if !@earnings then
      @earnings=Earning.where(user_id:@employee.id).order(:date)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
---
  def set_user
    @user = User.find(current_user.id)