app/controllers/attendance_controller.rb

  def in_time
    Attendance.create!(user_id:@user.id,in_time:@time)
---
INSERT INTO `attendances` (`user_id`, `in_time`, `created_at`, `updated_at`) VALUES (1, '2019-02-24 15:43:33', '2019-02-24 06:43:33', '2019-02-24 06:43:33')

  def remote_in_time
    Attendance.create!(user_id:@user.id,in_time:@time,is_remote:true)
---
INSERT INTO `attendances` (`user_id`, `in_time`, `is_remote`, `created_at`, `updated_at`) VALUES (1, '2019-02-24 15:28:47', TRUE, '2019-02-24 06:28:47', '2019-02-24 06:28:47')

  def out_time
    Attendance.where(user_id:@user.id).last.update!(out_time:@time)
---
SELECT  `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 1 ORDER BY `attendances`.`id` DESC LIMIT 1
UPDATE `attendances` SET `out_time` = '2019-02-24 15:43:27', `updated_at` = '2019-02-24 06:43:27' WHERE `attendances`.`id` = 4

  def break_in_time
    Break.create!(user_id:@user.id,attendance_id:@attendance.id,in_time:@time)
---
INSERT INTO `breaks` (`in_time`, `user_id`, `attendance_id`, `created_at`, `updated_at`) VALUES ('2019-02-24 15:29:33', 1, 4, '2019-02-24 06:29:33', '2019-02-24 06:29:33')

  def break_out_time
    Break.where(user_id:@user.id,attendance_id:@attendance.id).last.update!(out_time:@time)
---
SELECT  `breaks`.* FROM `breaks` WHERE `breaks`.`user_id` = 1 AND `breaks`.`attendance_id` = 4 ORDER BY `breaks`.`id` DESC LIMIT 1
UPDATE `breaks` SET `out_time` = '2019-02-24 15:34:13', `updated_at` = '2019-02-24 06:34:13' WHERE `breaks`.`id` = 5

  def set_attendance
    @attendance=Attendance.where(user_id:@user.id).last
---
SELECT  `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 1 ORDER BY `attendances`.`id` DESC LIMIT 1