app/controllers/earning_controller.rb

  def earn
    date=Date.today
    Earning.create!(user_id:@user.id,revenue:params[:revenue],date:date,location:params[:location])
---
INSERT INTO `earnings` (`user_id`, `date`, `revenue`, `created_at`, `updated_at`, `location`) VALUES (2, '2019-02-10', 2000, '2019-02-10 05:07:42', '2019-02-10 05:07:42', '[{:params=>nil}]')