app/controllers/home_controller.rb

  def index
    if @user.is_admin then
      redirect_to admin_index_path
    end
    @attendances=Attendance.where(user_id:@user.id).order(:in_time)
    @earnings=Earning.where(user_id:@user.id).order(:date)
---
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 10 ORDER BY `attendances`.`in_time` ASC
SELECT `earnings`.* FROM `earnings` WHERE `earnings`.`user_id` = 10 ORDER BY `earnings`.`date` ASC

  def search_month
    @attendances=Attendance.where(user_id:@user.id).date_month(params[:year],params[:month]).order(:in_time)
    @earnings=Earning.where(user_id:@user.id).date_month(params[:year], params[:month]).order(:date)
---
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`user_id` = 10 AND `attendances`.`in_time` BETWEEN '2019-02-01' AND '2019-03-01' ORDER BY `attendances`.`in_time` ASC
SELECT `earnings`.* FROM `earnings` WHERE `earnings`.`user_id` = 10 AND `earnings`.`date` BETWEEN '2019-02-01' AND '2019-02-28' ORDER BY `earnings`.`date` ASC

  def set_user
    @user = User.find(current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 10 ORDER BY `users`.`id` ASC LIMIT 1